[
    {
        "id": "01",
        "title": "Javascript and the DOM",
        "details": "Practice Vanilla JS and DOM by creating a tic-tac-toe game using click events and a reset button. Include a dark/light mode toggle using an html checkbox and the change event. Add simple animations to the game for a smoother and more satisfying user experience.",
        "demoLink": "https://atls4630-fwd.vercel.app/assignments/task1/index.html",
        "docuLink": "https://github.com/cnakpil/atls4630-fwd/blob/main/documentation/ttt/ttt.md"
    },
    {
        "id": "02",
        "title": "HTML Forms",
        "details": "A pure HTML/CSS form that can be linked to a SQL/noSQL database after the fact. Currently a demo to invite friends to hangout together.",
        "demoLink": "https://atls4630-fwd.vercel.app/assignments/task2/index.html",
        "docuLink": "/"
    },
    {
        "id": "03",
        "title": "Javascript Debugging Practice",
        "details": "Find and fix the errors on the quiz and post the fixed version to your portal. Hint: there are no errors in the CSS file, only the HTML file and the JavaScript file. ",
        "demoLink": "https://atls4630-fwd.vercel.app/assignments/task3/index.html",
        "docuLink": "/"
    },
    {
        "id": "04",
        "title": "Playing with APIs and JSON",
        "details": "Make a weather app that takes inspiration from Karen, of the movie Mean Girls, using the Geolocation API and the OpenWeatherApp API. The app only shows two pieces of information: the precipitation probability and the icon data that corresponds to the current weather conditions in the user's location. API data is refreshed every 5 minutes and will display default data if users do not want to allow the app to access their location data.",
        "demoLink": "https://atls4630-fwd.vercel.app/assignments/task4/index.html",
        "docuLink": "https://github.com/cnakpil/atls4630-fwd/blob/main/documentation/task4/task4.md"
    },
    {
        "id": "05",
        "title": "Practice with JavaScript Libraries",
        "details": "Add animations on scroll using the AOS JS library to a copy of my assignments page (this one) to see if it is a viable design choice in the future. The import broke when I wasn't looking, but the end result was viable enough that I am recreating this project in React, as imports seem to be more stable that way.",
        "demoLink": "/",
        "docuLink": "/"
    },
    {
        "id": "06",
        "title": "Design Component Layout for a React To-Do App",
        "details": "Use React JS documentation, knowledge of OOP, and the modular nature of React Functional Components to design the rough layout of a simple to-do app using React.",
        "demoLink": "/",
        "docuLink": "https://github.com/cnakpil/atls4630-fwd/blob/main/assignments/task6/task6.md"
    }
]